
## Plan Result




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.local_app_insights_connection_string
* Update
  * azurerm_resource_group.rg


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.local_app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "local_app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-home-office-integration-api-aat"
        name     = "ia-home-office-integration-api-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/ia-home-office-integration-api.git"
          - "application"         = "immigration"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#ia-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-06-07T09:20:15Z"
          - "managedBy"           = "Immigration"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":317,"Program":"tfcmt","SHA1":"","Vars":{}} -->